node {
  name: "input_data"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 114
        }
      }
    }
  }
}
node {
  name: "Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "Placeholder_1"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "Placeholder_2"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "Placeholder_3"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "Placeholder_4"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "Placeholder_5"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "keep_prob"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights/Initializer/random_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "r\000\000\000\000\020\000\000"
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights/Initializer/random_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights/Initializer/random_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights/Initializer/random_normal/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights/Initializer/random_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights/Initializer/random_normal/mul"
  op: "Mul"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights/Initializer/random_normal/RandomStandardNormal"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights/Initializer/random_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights"
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights/Initializer/random_normal"
  op: "Add"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights/Initializer/random_normal/mul"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights/Initializer/random_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights"
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 114
        }
        dim {
          size: 4096
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights/Assign"
  op: "Assign"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights/Initializer/random_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights/read"
  op: "Identity"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights"
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 9.999999747378752e-05
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights"
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights/Regularizer/l2_regularizer"
  op: "Mul"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights/Regularizer/l2_regularizer/scale"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights"
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/biases/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 4096
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4096
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/biases/Assign"
  op: "Assign"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/biases"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/biases/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/biases/read"
  op: "Identity"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/biases"
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/biases/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0010000000474974513
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/biases/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/biases"
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/biases/Regularizer/l2_regularizer"
  op: "Mul"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/biases/Regularizer/l2_regularizer/scale"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/biases/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/biases"
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/MatMul"
  op: "MatMul"
  input: "input_data"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/Add"
  op: "Add"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/MatMul"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/weights/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/weights"
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/weights"
  op: "HistogramSummary"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/weights/tag"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/biases/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/biases"
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/biases"
  op: "HistogramSummary"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/biases/tag"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/variables_initialization/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/activation/relu"
  op: "Relu"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/fully_connected/Add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/dropout/Shape"
  op: "Shape"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/activation/relu"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/dropout/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/dropout/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/dropout/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/dropout/Shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/dropout/random_uniform/sub"
  op: "Sub"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/dropout/random_uniform/max"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/dropout/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/dropout/random_uniform/mul"
  op: "Mul"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/dropout/random_uniform/RandomUniform"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/dropout/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/dropout/random_uniform"
  op: "Add"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/dropout/random_uniform/mul"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/dropout/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/dropout/add"
  op: "Add"
  input: "keep_prob"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/dropout/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/dropout/Floor"
  op: "Floor"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/dropout/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/dropout/div"
  op: "RealDiv"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/activation/relu"
  input: "keep_prob"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/dropout/mul"
  op: "Mul"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/dropout/div"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/dropout/Floor"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/activations/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/activations"
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/activations"
  op: "HistogramSummary"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/activations/tag"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/dropout/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights/Initializer/random_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\020\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights/Initializer/random_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights/Initializer/random_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights/Initializer/random_normal/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights/Initializer/random_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights/Initializer/random_normal/mul"
  op: "Mul"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights/Initializer/random_normal/RandomStandardNormal"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights/Initializer/random_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights"
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights/Initializer/random_normal"
  op: "Add"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights/Initializer/random_normal/mul"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights/Initializer/random_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights"
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4096
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights/Assign"
  op: "Assign"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights/Initializer/random_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights/read"
  op: "Identity"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights"
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 9.999999747378752e-05
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights"
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights/Regularizer/l2_regularizer"
  op: "Mul"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights/Regularizer/l2_regularizer/scale"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights"
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/biases/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/biases/Assign"
  op: "Assign"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/biases"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/biases/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/biases/read"
  op: "Identity"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/biases"
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/biases/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0010000000474974513
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/biases/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/biases"
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/biases/Regularizer/l2_regularizer"
  op: "Mul"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/biases/Regularizer/l2_regularizer/scale"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/biases/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/biases"
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/MatMul"
  op: "MatMul"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_0/dropout/mul"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/Add"
  op: "Add"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/MatMul"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/weights/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/weights"
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/weights"
  op: "HistogramSummary"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/weights/tag"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/biases/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/biases"
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/biases"
  op: "HistogramSummary"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/biases/tag"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/variables_initialization/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/activation/relu"
  op: "Relu"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/fully_connected/Add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/dropout/Shape"
  op: "Shape"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/activation/relu"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/dropout/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/dropout/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/dropout/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/dropout/Shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/dropout/random_uniform/sub"
  op: "Sub"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/dropout/random_uniform/max"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/dropout/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/dropout/random_uniform/mul"
  op: "Mul"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/dropout/random_uniform/RandomUniform"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/dropout/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/dropout/random_uniform"
  op: "Add"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/dropout/random_uniform/mul"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/dropout/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/dropout/add"
  op: "Add"
  input: "keep_prob"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/dropout/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/dropout/Floor"
  op: "Floor"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/dropout/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/dropout/div"
  op: "RealDiv"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/activation/relu"
  input: "keep_prob"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/dropout/mul"
  op: "Mul"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/dropout/div"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/dropout/Floor"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/activations/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/activations"
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/activations"
  op: "HistogramSummary"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/activations/tag"
  input: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/fully_connected_block_1/dropout/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/last_fully_connected_block/fully_connected/variables_initialization/weights/Initializer/random_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/last_fully_connected_block/fully_connected/variables_initialization/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "@\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/last_fully_connected_block/fully_connected/variables_initialization/weights/Initializer/random_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Multilayer_Perceptron_MultiClass/Multilayer_Perceptron-pie_izquierdo/last_fully_connected_block/fully_connected/variables_initialization/weights"
